[
  {
    "title": "Kettering Health Notifies Patients of Data Breach Months After Ransomware Attack",
    "url": "custom-kettering-health-data-breach",
    "description": "Kettering Health has begun notifying patients that their personal and medical information may have been compromised in a cyberattack that struck the regional hospital network last year. \n\n\n\nThe healthcare system, which operates hospitals and medical facilities across the Dayton and Miami Valley region, confirmed that the breach stems from a ransomware attack discovered on May 20, 2025. The attack caused widespread technology outages across the network, disrupting patient services, electronic medical records, scheduling systems, and the MyChart patient portal for several days. \n\nIn letters mailed to affected individuals in early February, Kettering Health said an unauthorized party may have accessed its network between April 9 and May 20, 2025, before the intrusion was contained. \n\nAccording to the notification, information potentially exposed varies by patient but may include names, Social Security numbers, driver’s license or passport numbers, financial account details, health insurance information, medical treatment records, billing data, and, in some cases, usernames and passwords. \n\nKettering Health said it launched an investigation with the assistance of third-party cybersecurity experts and notified federal law enforcement. The organization reported that it has since taken steps to strengthen its network security, including reviewing and updating policies, procedures, and monitoring systems. \n\nThe ransomware group known as “Interlock” previously claimed responsibility for the attack, alleging it stole hundreds of gigabytes of data from the health system. Kettering Health has not publicly confirmed the exact volume of data involved but acknowledged that patient information was accessed. \n\nThe breach adds to a growing number of cyberattacks targeting healthcare providers nationwide. Hospitals are frequent targets due to the sensitive nature of medical and personal data, as well as the operational urgency required to maintain patient care. \n\nKettering Health is offering affected individuals complimentary credit monitoring and identity protection services. Patients have a limited window to enroll in those services following receipt of their notification letter. \n\nAt least one lawsuit has been filed in connection with the breach, alleging the healthcare provider failed to adequately protect patient data. The litigation is ongoing. \n\nPatients who believe they may have been affected are encouraged to carefully review any correspondence from Kettering Health, monitor financial and insurance statements, consider placing fraud alerts or credit freezes with credit reporting agencies, and report suspicious activity immediately. \n\nKettering Health operates more than a dozen medical centers and numerous outpatient facilities throughout southwest Ohio, serving hundreds of thousands of patients each year.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/d6cieMB.jpeg",
    "pubDate": "2026-02-14T05:23:00Z",
    "section": "health",
    "custom": true
  },

  {
    "title": "Nintendo Switch 2 Is Off to a Blazing Start: Here Are All the Big New Games on the Way",
    "url": "nintendo-switch-2-new-games-feb-26",
    "description": "The Nintendo Switch 2 has officially ushered in a new era for Nintendo, and if the release slate is any indication, the company is not slowing down. With a mix of brand-new first-party blockbusters, long-awaited sequels, upgraded editions of modern classics, and major third-party support, the Switch 2 is shaping up to have one of the strongest early libraries in Nintendo history.\n\nLaunching alongside the system, Mario Kart World set the tone for the console’s ambitions. Expanding beyond traditional circuits, the new entry introduces larger, more dynamic tracks and enhanced online features, positioning it as the definitive Mario Kart experience for this generation. Nintendo has long relied on Mario Kart to anchor new hardware, and with the added power of Switch 2, the series finally has room to evolve in meaningful ways.\n\nReports also point toward a brand-new 3D Mario adventure arriving in 2026. While Nintendo has not revealed full details, history suggests this could become the system’s defining title. From Super Mario 64 to Galaxy to Odyssey, each major 3D installment has redefined platforming for its era. Expectations are high that this next entry will serve as both a creative leap and a technical showcase.\n\nNintendo’s early first-party lineup is already impressively diverse. Mario Tennis Fever brings fast-paced sports action with modernized visuals. Kirby Air Riders revives the cult-favorite racing spin-off with upgraded performance. Tomodachi Life: Living the Dream marks the return of the chaotic Mii life simulation series fans have requested for years. Fire Emblem: Fortune’s Weave continues the tactical RPG franchise’s momentum with a new strategic epic. And after years of anticipation, Metroid Prime 4: Beyond is finally landing with enhancements tailored for the new hardware.\n\nPerhaps the biggest surprise is the scale of third-party support. Switch 2 is not just receiving Nintendo exclusives; it is attracting major modern releases as well. Resident Evil Requiem and Resident Evil Village are both arriving in enhanced editions. Fallout 4: Anniversary Edition is coming to the platform. Cyberpunk 2077: Ultimate Edition and Street Fighter 6 are also confirmed. Sega is bringing Yakuza Kiwami 3, while Dynasty Warriors 3: Complete Edition Remastered adds large-scale action to the lineup. Hades II continues its momentum on the system, and The Duskbloods, connected to FromSoftware’s parent company, is slated for release. Digimon Story: Time Stranger further strengthens the RPG offering.\n\nThe Pokémon franchise is also expanding on Switch 2 with Pokémon Pokopia, a life-simulation spin-off that takes the brand in a fresh direction. While a new mainline Pokémon RPG has not yet been detailed, expectations are high that Switch 2 will eventually host the series’ next major evolution.\n\nBeyond the headline titles, the lineup includes darker and more experimental experiences. Reanimal delivers a cinematic horror adventure. Opus: Prism Peak offers a narrative-driven journey. Kingdom’s Return: Time-Eating Fruit and the Ancient Monster introduces an ambitious action-RPG concept. Rune Factory: Guardians of Azuma arrives in a Switch 2 edition. Enhanced versions of The Legend of Zelda: Breath of the Wild and Tears of the Kingdom take advantage of improved performance and visuals.\n\nLooking at the release window across 2025 and 2026, the cadence is aggressive. 2025 brought Mario Kart World, Kirby Air Riders, and Hades II. Early 2026 adds Mario Tennis Fever, Reanimal, and the new Resident Evil titles. Spring and summer introduce Pokémon Pokopia, Tomodachi Life: Living the Dream, Kingdom’s Return, and Digimon Story. Late 2026 and beyond are expected to feature Fire Emblem: Fortune’s Weave, Metroid Prime 4: Beyond, Fallout 4: Anniversary Edition, The Duskbloods, and the anticipated new 3D Mario.\n\nIf even a portion of these titles meet expectations, the Nintendo Switch 2 will not just be a successful successor; it could become one of Nintendo’s strongest platform launches ever. By anchoring the system with Mario Kart, preparing a new 3D Mario, delivering long-awaited sequels like Metroid Prime 4, securing substantial third-party AAA support, and maintaining Nintendo’s experimental charm with titles like Tomodachi Life and Pokémon spin-offs, the company appears ready to compete at full scale once again.\n\nFor longtime Nintendo fans and the broader gaming industry alike, this lineup signals ambition. And if this is only the beginning, the Switch 2 era may just be getting started.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/3NJLt2q.jpeg",
    "pubDate": "2026-02-12T21:54:40Z",
    "section": "entertainment",
    "custom": true
  },

    {
    "title": "Montgomery County officials have approved plans to relocate the Job Center",
    "url": "montgomery-county-moves-job-center",
    "description": "Montgomery County officials have approved plans to relocate the county’s Job Center, setting the stage for significant changes to how workforce and family services are delivered in the region.\n\nThe current Job Center, located at 1111 S. Edwin C. Moses Blvd. in Dayton, has operated in a building leased from St. Vincent de Paul for nearly 30 years. County leaders say the move is aimed at modernizing services and creating a more efficient, accessible, and welcoming environment for residents who rely on employment assistance, job training, and family support programs.\n\nCommissioners have indicated that rather than renewing the long-term lease at the existing site, the county will pursue plans for a newly developed facility. While a permanent location has not yet been finalized, officials say the goal is to better align services under one roof and improve the overall experience for job seekers and families navigating public assistance programs.\n\nTo ensure there is no interruption in services, several departments will temporarily relocate in the coming months. Adult Career Services will move to the Business Solutions Center on Cincinnati Street. Youth Career Services will operate out of the Employment Opportunity Center on West Third Street. Meanwhile, Job and Family Services offices will transition to the Southview Center on Thorpe Drive. County officials stress that residents will continue to have access to the same core services during the transition.\n\nThe Job Center houses OhioMeansJobs|Montgomery County along with workforce development programs and other support services designed to connect residents with employment opportunities and training resources. Leaders say the relocation effort reflects a broader strategy to strengthen the county’s workforce infrastructure and position the region for long-term economic growth.\n\nDetails regarding the final site selection, construction timeline, and projected costs are expected to be released in future announcements. As plans move forward, residents and stakeholders will be watching closely to see how the transition unfolds and what the new facility will ultimately look like.\n\nFor continuing coverage on this developing story and updates on the future home of the Montgomery County Job Center, be sure to check back regularly.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/4Pdt6Hd.jpeg",
    "pubDate": "2026-02-12T22:17:00Z",
    "section": "local",
    "custom": true
  },

   {
    "title": "Cash Forecast Signals 2027 Showdown: Oakwood Schools May Ask Voters for New Operating Levy",
    "url": "oakwood-school-levy-2027",
    "description": "Oakwood City Schools may return to voters in 2027 for a new operating levy as district leaders warn that projected deficit spending could begin that year if no additional revenue is secured.\n\nDistrict Treasurer Laura Sauber recently presented long-term financial forecasts showing expenditures beginning to outpace revenues in fiscal year 2027. While the district currently maintains a healthy cash balance, officials say that cushion would steadily decline over the following years without new funding.\n\nAccording to the district’s five-year forecast, Oakwood expects to end fiscal year 2025 with roughly $13.9 million in cash reserves, despite spending exceeding revenues during the year. Revenues and expenditures are projected to remain relatively flat in fiscal year 2026. However, by 2027 and beyond, rising costs — including salaries, benefits, utilities and contracted services — are expected to outstrip incoming funds.\n\nSchool leaders emphasized that no levy has yet been placed on the ballot. The discussion is part of routine financial planning designed to give the board time to evaluate options well in advance of potential shortfalls.\n\nIf pursued, a 2027 measure would likely be a new-money operating levy, which would generate additional local tax revenue to support day-to-day expenses such as classroom instruction, staffing, transportation and student services. Operating levies differ from permanent improvement levies or bond issues, which are typically restricted to buildings and facilities.\n\nIn the nearer term, Oakwood schools plan to seek renewal of an existing permanent improvement levy in 2026. That measure would not raise new taxes but would continue funding for maintenance and capital needs.\n\nOakwood voters have supported several recent school funding initiatives, including a combined operating and permanent improvement levy in 2023 and a bond issue in 2025 aimed at updating elementary school facilities. The district’s leadership says those measures addressed specific operational and building needs but did not eliminate the long-term impact of inflation and cost growth.\n\nDistrict officials say they will continue monitoring enrollment trends, state funding formulas and expenditure growth before making any formal decision about a 2027 ballot request.\n\nThe Oakwood Board of Education is expected to revisit its financial outlook in upcoming meetings as it weighs whether to formally ask residents for additional operating support. Community members can expect further discussion and public input opportunities before any levy is placed on the ballot.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/fmTDE4U.jpeg",
    "pubDate": "2026-02-13T14:58:00Z",
    "section": "local",
    "custom": true
  },

   {
    "title": "Major U.S. Airspace Incident - El Paso Airspace Shutdown",
    "url": "el-paso-airspace-shutdown",
    "description": "Laser Confusion Over Texas: Military Anti-Drone Test Triggers FAA Shutdown of El Paso Airspace\n\nAn unexpected airspace shutdown over El Paso, Texas, has ignited national debate over military technology, aviation safety, and federal coordination after a counter-drone laser system was deployed near a major civilian airport.\n\nThe incident began when the Federal Aviation Administration (FAA) abruptly halted flights in and out of El Paso International Airport, citing “special security reasons.” A Notice to Airmen (NOTAM) restricted civilian air traffic, grounding commercial flights and disrupting medical transport operations. Initially described as a security measure that could last up to 10 days, the restriction was lifted within hours after federal officials determined there was no ongoing threat to aviation safety.\n\nAt the center of the controversy is the reported use of a 20-kilowatt directed-energy weapon known as LOCUST, deployed by U.S. Customs and Border Protection (CBP) near Fort Bliss with Pentagon authorization. The laser system was allegedly used to target what authorities believed to be cartel-operated drones flying near the U.S.–Mexico border. However, subsequent reporting suggested the objects may have been harmless party balloons, raising questions about the reliability of threat assessments and the decision-making process that followed.\n\nThe rapid shutdown — and reversal — exposed what lawmakers are calling a serious breakdown in communication between federal agencies. Members of Congress from both parties have criticized the apparent lack of coordination between the FAA, the Department of Defense, and CBP. Senate oversight discussions this week focused on how advanced military systems were deployed in proximity to civilian air corridors without prior notice to aviation authorities or local leaders.\n\nEl Paso officials said they were caught off guard by the FAA order, which sent confusion rippling through airlines, airport staff, and travelers. Emergency medical flights were temporarily disrupted, and commercial carriers scrambled to reroute aircraft. Though operations resumed the same day, the episode has intensified scrutiny of how emerging defense technologies are integrated into domestic airspace.\n\nFederal authorities have long warned about increased drone activity along the southern border, including surveillance operations allegedly linked to Mexican drug cartels. The Department of Homeland Security has invested heavily in counter-drone capabilities in recent years, arguing that unmanned aerial systems pose a growing threat to border security. But aviation experts caution that high-powered directed-energy systems — especially lasers — require strict coordination protocols when used near civilian airports, where even minor miscalculations could have catastrophic consequences.\n\nTransportation officials have stated that the perceived threat was “neutralized,” but have offered limited details about what triggered the initial alert or how interagency communication broke down so dramatically. Lawmakers are now calling for clearer rules governing the domestic use of military-grade counter-drone technology and better safeguards to prevent future airspace disruptions.\n\nAs investigations continue, the El Paso incident is emerging as a pivotal test of how the United States balances national security innovation with the safety of its civilian aviation system. What began as a localized security response has quickly evolved into a broader reckoning over oversight, transparency, and the risks of deploying advanced weapons technology close to home.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/wGta1AR.jpeg",
    "pubDate": "2026-02-13T15:11:00Z",
    "section": "national",
    "custom": true
  },

   {
    "title": "Judge Keeps Haiti TPS Protections in Place, Easing Fears in Springfield Community",
    "url": "springfield_tps_stays_in_place",
    "description": "A federal judge has denied the federal government’s request to move forward with ending Temporary Protected Status for Haitians, delivering temporary relief to hundreds of families in Springfield and across the Miami Valley.\n\nU.S. District Judge Ana Reyes ruled this week that the Department of Homeland Security cannot lift protections for Haitian TPS holders while the legal battle continues in higher courts. The decision blocks the administration’s attempt to allow the expiration to proceed during the appeals process.\n\nTemporary Protected Status, commonly known as TPS, allows people from certain countries experiencing armed conflict, natural disasters, or extraordinary conditions to live and work legally in the United States for designated periods of time. Haiti has been designated for TPS following years of political instability, gang violence, and natural disasters, including the devastating 2010 earthquake.\n\nIn her decision, Judge Reyes expressed concern that ending TPS immediately could put Haitian immigrants at risk. TPS applicants are required to provide their names and current addresses to the government as part of the registration process. The court noted that the Department of Homeland Security already possesses that information, raising fears within immigrant communities that individuals could be quickly located if protections were lifted.\n\nFederal attorneys argued that Haitian nationals would not be singled out if TPS were terminated, but instead would be treated like others without legal status. The judge was not persuaded, writing that the government failed to show it would suffer irreparable harm if protections remained in place while the case is appealed.\n\nThe ruling does not permanently extend TPS for Haitians. Instead, it preserves the status quo while the case works its way through the appellate courts. Legal experts say the issue could ultimately reach the U.S. Supreme Court.\n\nThe decision carries particular weight in Springfield, which has a growing Haitian community. Many families have built lives in Clark County over the past several years, filling jobs in manufacturing, healthcare support, food service, and other sectors. Community leaders say the uncertainty surrounding TPS has created anxiety among residents worried about deportation and family separation.\n\nSome local residents have voiced support for maintaining protections, pointing to Haiti’s ongoing humanitarian crisis. Others argue TPS was intended to be temporary and should not become a long-term solution. The debate has played out both nationally and within the Miami Valley.\n\nFor now, Haitian TPS holders in Springfield can continue to live and work legally while the courts consider the broader legal questions surrounding executive authority and immigration policy.\n\nAs the appeals process unfolds, families across the region are watching closely. The outcome could shape not only their futures, but also the future of Temporary Protected Status nationwide. Check back for updates as this developing story continues.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/HK8bWmc.jpeg",
    "pubDate": "2026-02-13T15:30:00Z",
    "section": "local",
    "custom": true
  },

    {
    "title": "Crosstown Rivals Take Center Stage: Dayton, Wright State Set for Showdown at Day Air Ballpark",
    "url": "dayton-vs-wright-state-baseball-at-day-air-ball-park",
    "description": "The crack of the bat will echo a little louder in downtown Dayton on April 15.\n\nThe University of Dayton and Wright State University baseball programs are set to renew their crosstown rivalry under the lights at Day Air Ballpark, home of the Dayton Dragons. First pitch is scheduled for 7 p.m., and if history is any indication, the seats won’t stay empty for long.\n\nThis will mark the 138th meeting between the Flyers and Raiders, a rivalry that has grown steadily more intense with each passing season. What makes this matchup different isn’t just the opponent — it’s the stage. Moving the game to the Dragons’ downtown home transforms an already spirited midweek contest into a showcase event for college baseball in the Miami Valley.\n\nFor Dayton, the opportunity to play in a professional ballpark offers both recruiting appeal and a chance to energize its fan base. The Flyers have leaned into the experience in recent seasons, drawing strong crowds and creating a postseason-like atmosphere in the middle of April.\n\nWright State, meanwhile, enters most seasons with the confidence of a program that has consistently contended in the Horizon League and made noise on the national stage. The Raiders’ blend of power at the plate and disciplined pitching has often made them the measuring stick in Southwest Ohio.\n\nLast year’s scheduled meeting at Day Air Ballpark was wiped away by weather, adding an extra layer of anticipation to this year’s showdown. Players on both sides remember the missed opportunity — and neither dugout will lack motivation when the first pitch is thrown.\n\nBeyond bragging rights, the game represents something larger for the Dayton baseball community. It’s a chance to spotlight two Division I programs in a city that prides itself on supporting the game at every level — from youth leagues to the Dragons’ famously loyal fan base.\n\nTickets are expected to be affordable, with strong student turnout from both campuses. If past crowds are any indication, the energy will feel more like a summer minor league thriller than a typical college midweek matchup.\n\nOn April 15, the rivalry moves downtown. And for one night, the heart of the Miami Valley baseball scene will beat inside Day Air Ballpark.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/1ibzzD7.jpeg",
    "pubDate": "2026-02-13T16:46:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "West Dayton’s Second Chance: Voters Back Public Hospital Levy After Years Without One",
    "url": "new-hostpital-levy-backed-by-community-in-west-dayton-ohio",
    "description": "Dayton voters have approved a 1-mill property tax levy to help fund a new public hospital on the city’s west side, marking a significant milestone in a years-long push to restore hospital services lost when Good Samaritan Hospital shut its doors in 2018.\n\nThe closure of Good Samaritan left West Dayton without a full-service hospital, creating what many residents and health advocates described as a health care desert. For families in northwest Dayton, the loss meant longer travel times for emergency care, childbirth, and inpatient treatment — and deeper concerns about health equity in a historically Black and underserved part of the city.\n\nThe newly approved levy, known on the ballot as Issue 9, will collect 1 mill over 10 years, generating an estimated $2 million annually — or about $20 million total. Supporters say the funding will jump-start planning, land acquisition, and early development costs for a publicly owned hospital designed to serve community needs.\n\nFor many residents, the vote represents more than a tax measure. It is the culmination of persistent grassroots advocacy led by neighborhood leaders, clergy members and public health activists who have pressed city officials for years to address the west side’s hospital gap. Petition drives, town halls and public testimony kept the issue alive after earlier efforts stalled.\n\nHealth professionals have repeatedly warned that access matters. Studies consistently show that longer travel times to emergency departments are associated with poorer outcomes for time-sensitive conditions such as stroke, heart attack and traumatic injury. In communities already facing higher rates of chronic illness, the absence of nearby inpatient services can compound disparities.\n\nStill, major questions remain. Building and operating a hospital requires far more than $20 million. Experts note that the levy revenue will likely need to be paired with state or federal funding, private partnerships, or health system collaboration. City leaders will also have to determine governance, staffing models and the scope of services — whether the facility will offer full inpatient care, emergency services only, or a phased expansion over time.\n\nSupporters argue that public ownership could allow the hospital to prioritize community health needs over profit margins, potentially expanding preventive care, maternal health services and chronic disease management. Critics caution that financial sustainability will be the project’s biggest hurdle.\n\nWhat is clear is that West Dayton residents made their voices heard at the ballot box. After seven years without a neighborhood hospital, voters have signaled that restoring local access to care is a priority.\n\nThe road ahead will require careful planning, transparent leadership and continued community engagement. But for many on Dayton’s west side, the levy’s approval represents something they have been waiting for since 2018: a tangible step toward bringing hospital care back home.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/OW36n6d.jpeg",
    "pubDate": "2026-02-13T17:10:00Z",
    "section": "local",
    "custom": true
  },

    {
    "title": "Death Toll in Iran Protests Reportedly Surpasses 7,000, Activists Say",
    "url": "reported-death-toll-passes-7000-in-iran",
    "description": "The death toll from Iran’s sweeping crackdown on anti-government protests has climbed past 7,000, according to figures released by activist groups monitoring the unrest. The numbers, reported this week by the U.S.-based Human Rights Activists News Agency, mark one of the deadliest periods of political violence in the country in decades.\n\nThe protests, which erupted over economic hardship and political grievances, quickly evolved into broader demonstrations challenging the country’s leadership. In response, security forces launched a forceful campaign to suppress gatherings across major cities and provincial towns. Activists say their tally is based on confirmed identities and documented cases collected through networks inside and outside the country.\n\nIranian officials have released significantly lower casualty figures, creating a sharp discrepancy between state-reported numbers and independent counts. Government sources have argued that the unrest involved armed agitators and that members of the security forces were also killed. Independent verification remains difficult due to media restrictions, arrests of journalists, and periodic internet blackouts imposed during the height of the demonstrations.\n\nHuman rights organizations say the scale of reported deaths suggests a systematic effort to quash dissent. The United Nations Human Rights Council has previously condemned the violence and called for transparent investigations into alleged abuses. International observers continue to press for accountability, though diplomatic tensions have complicated efforts to conduct independent inquiries on the ground.\n\nBeyond the fatalities, thousands more have reportedly been injured or detained. Families of victims have described pressure to remain silent, while activists warn that fear and censorship may mean the true number of casualties is even higher than current estimates.\n\nAs the situation continues to unfold, the reported death toll underscores the profound instability gripping the nation and raises renewed questions about the future of civil dissent and political reform in Iran.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/1NWEsWi.jpeg",
    "pubDate": "2026-02-14T00:50:00Z",
    "section": "world",
    "custom": true
  },

    {
    "title": "Raiders Searching for Consistency as Horizon League Race Tightens",
    "url": "wright-state-raiders-mens-basketball-searches-for-consistency-in-horizon-league",
    "description": "The margin for error is shrinking, and for Wright State, the message is clear: now is the time to put it all together.\n\nThe Wright State Raiders men's basketball remain firmly in the hunt atop the Horizon League standings, but if you’ve followed this team closely, you know the conversation inside the locker room isn’t about talent. It’s about consistency.\n\nHead coach Clint Sargent has acknowledged in recent weeks that while the Raiders have shown flashes of high-level basketball, they haven’t yet delivered the kind of complete 40-minute performance that defines championship teams in late February.\n\nThere have been stretches where Wright State looks dominant — balanced scoring, crisp ball movement, and defensive pressure that fuels transition opportunities. When the Raiders are locked in, they resemble a team capable of making a serious run once tournament play begins.\n\nBut the league race has exposed some cracks.\n\nA recent late-game loss to the Detroit Mercy Titans men's basketball underscored the issue. Cold shooting and defensive lapses in the final minutes turned a winnable game into a missed opportunity. In a conference where teams are separated by just a game or two, those moments loom large.\n\nVeteran leadership has helped steady the ship at times. Michael Imariagbe has delivered key performances, particularly when the offense has stalled elsewhere. Still, Wright State’s postseason hopes won’t hinge on one player. They will depend on execution — closing out possessions, limiting turnovers, and finishing games with composure.\n\nWith only a handful of regular-season games remaining before the Horizon League tournament tips off, every possession now carries added weight. Seeding implications are real. Home-court advantages could prove decisive. Confidence, perhaps most of all, will shape how far this group can go.\n\nThe Raiders don’t need wholesale changes. They need sharper focus in late-game situations and steadier play from start to finish. If they find that rhythm over the next few weeks, Wright State has the tools to turn potential into postseason success.\n\nMarch doesn’t reward promise. It rewards consistency. And for the Raiders, the time to prove they have it is now.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/EdV4Vfp.png",
    "pubDate": "2026-02-14T01:11:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "Flyers Eye 11th Straight Over Davidson as A-10 Race Tightens",
    "url": "dayton-flyers-mens-basketball-seek-11th-straight-win-over-davidson",
    "description": "The February stretch is where seasons are defined, and for the University of Dayton Flyers, Sunday’s showdown at UD Arena carries weight far beyond bragging rights.\n\nDayton enters the weekend seeking its 11th straight victory in the series against the Davidson Wildcats, a remarkable run in what has quietly become one of the Atlantic 10 Conference’s most consistent matchups. But this meeting is about more than history. It’s about positioning.\n\nWith seven games remaining in the regular season, Dayton, Davidson and Duquesne are locked in a three-way tie for fifth place in the A-10 standings. The margin for error is gone. Every possession, every defensive stop, every late-game execution detail could shift the conference tournament picture.\n\nThe Flyers (15-9 overall, 6-5 A-10) are looking to rebound after a lopsided road loss at VCU that exposed defensive lapses and turnover trouble. Head coach Anthony Grant did not mince words afterward, emphasizing the need for greater toughness and discipline as the calendar turns toward March.\n\nFortunately for Dayton, history suggests confidence against Davidson. The Flyers have controlled this series in recent years, using physical defense and efficient half-court offense to frustrate the Wildcats’ traditionally methodical style of play. UD Arena has also been a fortress, where crowd energy often fuels extended scoring runs.\n\nStill, Davidson is not arriving in Dayton simply to play spoiler. The Wildcats understand the standings just as well as anyone. A win Sunday would snap the Flyers’ dominance in the series and provide a critical head-to-head advantage in a tightly packed middle tier of the conference.\n\nDuquesne’s presence in the tie only adds intrigue. With multiple teams clustered in the standings, potential tiebreaker scenarios loom large. That makes Sunday’s matchup feel closer to a postseason contest than a routine regular-season game.\n\nFor Dayton, the formula is clear: cleaner ball movement, sharper perimeter defense and a renewed edge on the glass. When the Flyers protect the ball and control tempo, they are capable of beating anyone in the league. When they don’t, the results can unravel quickly.\n\nThe opportunity is there. Extend the streak. Create separation in the standings. Regain momentum before the stretch run tightens even further.\n\nWith March approaching and seven games left to shape their destiny, the Flyers know the message is simple — defend home court, and let the rest fall into place.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/LPcSbBJ.png",
    "pubDate": "2026-02-14T01:33:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "Historic Heart Reopens: Dayton Arcade Marketplace Set for March Debut",
    "url": "historic-dayton-arcade-set-to-fully-reopen-in-march",
    "description": "After decades of uncertainty, false starts and scaffolding, the final chapter of downtown Dayton’s most ambitious restoration story is about to be written.\n\nThe retail marketplace inside the historic Dayton Arcade is set to open in March, marking the completion of the multi-year redevelopment of the nine-building landmark that has stood at the center of the city since the early 1900s.\n\nLocated in the North Arcade at 24 W. Third St., the new marketplace will feature roughly 7,500 square feet of street-level retail space designed to showcase local entrepreneurs and small businesses. A public kickoff event, “Arcade Commons,” is scheduled for early March and is expected to draw residents downtown to shop, dine and celebrate the project’s long-awaited finish line.\n\nAmong the first wave of tenants are Luke’s Custom Cakes, Smales Pretzel Bakery, Pink Moon Goods, Too, Maria’s at the Market, Tiffany’s on Third and Arcade Events. The mix reflects a deliberate strategy: keep the focus local, experiential and community-driven.\n\nFor many Daytonians, this opening represents more than new storefronts. Originally built between 1902 and 1904, the Arcade was once one of the region’s premier shopping and gathering destinations, anchored by its iconic glass rotunda. But after closing in 1991, the property sat vacant for nearly 30 years, a visible reminder of downtown’s broader economic struggles.\n\nThat began to change in 2019 when a partnership led by Cross Street Partners and The Model Group launched a massive mixed-use redevelopment. The plan blended historic preservation with modern needs — adding apartments, innovation space, event venues and a hotel component, including a Hilton Garden Inn. Phase by phase, lights flicked back on inside buildings many feared would never fully recover.\n\nThe retail marketplace was one of the final pieces. Its opening signals that the restoration effort — often described as one of the most complex historic redevelopment projects in Dayton’s history — has reached completion.\n\nCity leaders and project partners have long argued that the Arcade’s rebirth would serve as both an economic engine and symbolic anchor for downtown’s continued growth. With new residents living upstairs, visitors staying overnight and entrepreneurs opening shop at street level, that vision is now tangible.\n\nFor a generation that only knew the Arcade as a shuttered relic, March will offer something different: open doors, lit display windows and the steady hum of foot traffic beneath the rotunda.\n\nAfter 30 years of waiting, the heart of downtown Dayton is beating again.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/mZuigEN.jpeg",
    "pubDate": "2026-02-14T01:49:00Z",
    "section": "business",
    "custom": true
  },

    {
    "title": "Dayton Children’s Expands Pediatric Footprint Into Urbana and Springfield",
    "url": "dayton-children's-hospital-expanding-to-urbana-and-springfield",
    "description": "Families in Champaign and Clark counties will soon see expanded access to pediatric care as Dayton Children’s Hospital moves into Urbana and Springfield through an agreement with Mercy Health.\n\nUnder the transition, Dayton Children’s will assume operations of Mercy Health’s pediatric practice in Urbana and rehabilitation services in Springfield. The change is expected to take effect in early March, with physicians, therapists and support staff at those locations becoming employees of Dayton Children’s as part of the integration.\n\nHospital leaders have emphasized that families should not experience interruptions in care. Providers are expected to remain in place, appointments will continue as scheduled, and services will stay at their current sites. Over time, the offices will transition to Dayton Children’s branding, signage and operational systems, but officials say the goal is a seamless handoff for patients.\n\nFor Dayton Children’s, the expansion represents another step in a long-term strategy to extend its pediatric-focused model beyond its main campus in Dayton and into surrounding communities. Rather than requiring families to travel into the city for every appointment, the hospital system has increasingly worked to bring primary care, specialty clinics and therapy services closer to where children live and go to school.\n\nBy incorporating the Urbana pediatric practice and Springfield rehabilitation services into its network, Dayton Children’s strengthens the pipeline of care — from routine wellness visits and immunizations to physical, occupational and speech therapy. Families whose children require more advanced specialty services will also have a more direct connection into the hospital’s broader system.\n\nMeanwhile, Mercy Health will continue operating its other regional facilities, including Mercy Health — Urbana Hospital, while shifting these pediatric and rehab services to a system dedicated exclusively to children. Healthcare analysts note that partnerships like this are becoming more common across Ohio as hospital systems look to preserve access in smaller cities while maintaining strong specialty expertise.\n\nCommunity leaders say the change could be particularly meaningful for families in rural parts of Champaign and Clark counties, where access to pediatric subspecialists has historically required longer travel times. Having Dayton Children’s name and resources embedded locally may also help with recruitment of pediatric providers and therapists in the years ahead.\n\nAs the transition moves forward, officials from both organizations say their shared priority is continuity and quality of care. For parents in Urbana and Springfield, the expansion signals something simple but significant: trusted pediatric care, closer to home, backed by one of the region’s leading children’s health systems.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/o4Fdz07.png",
    "pubDate": "2026-02-14T02:06:00Z",
    "section": "health",
    "custom": true
  },

    {
    "title": "Redhawks vs. Bobcats — Battle of the Bricks Begins in Oxford",
    "url": "miami-ohio-men's-basketball-vs-ohio-university-bobcats-feb-13",
    "description": "The first whistle has blown and the crowd at Millett Hall is already electric as the Miami (OH) RedHawks host the Ohio University Bobcats in tonight’s highly anticipated Battle of the Bricks men’s basketball matchup. Miami, riding a historic 24-0 undefeated start to the season, welcomes Ohio into Oxford with the perfect record on the line and a packed house ready to see if the RedHawks can maintain their march toward history.\n\nThrough the early minutes, both teams are settling in, but the question on every fan’s mind is the same: Can Miami keep its unbeaten run alive? Miami’s electric offense and stout defense have made them one of the most talked-about mid-major teams in the country this year, with national attention mounting as the season reaches crunch time.\n\nFor the Bobcats, this game represents a chance to shake up the conference and snap a near-perfect opponent’s rhythm. Ohio has had its moments this season with gritty performances in MAC play, and coach Jeff Boals’ squad has shown the ability to hang with top competition — making tonight’s matchup all the more intriguing.\n\nHistorically, this rivalry has seen its share of memorable battles, and though Miami owns the spotlight this season, Ohio has proven it can rise to the occasion when it matters most. The Bobcats will lean on their experience and physicality to try and derail Miami’s dream run.\n\nAs this one just got underway, fans inside Millett Hall and viewers across the region are locked in. Will Miami continue its flawless campaign, or will Ohio play spoiler on this February night?\n\nStay tuned for updates and check back later tonight for the final result and full postgame reaction.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/yLWwbQ7.jpeg",
    "pubDate": "2026-02-14T02:24:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "Dayton Weekend Weather: Mild Temperatures and a Chance of Sunday Showers",
    "url": "dayton-ohio-weekend-weather-feb-13-2026",
    "description": "As the weekend settles in across the Miami Valley, we’re looking at a fairly calm and mild pattern — a welcome break from the bitter cold and disruptive winter systems we’ve seen recently. If you have plans in and around the Dayton area, the forecast is generally cooperative with only minor changes as we move toward Sunday.\n\nFriday will bring a mix of sunshine and passing clouds, making for a pleasant start to the weekend. Afternoon highs will reach the upper 40s, with overnight lows dropping into the upper 20s. A light breeze will add a slight chill at times, but overall conditions will be comfortable for February standards.\n\nSaturday turns a bit warmer, with highs climbing into the low 50s. Expect some sunshine early in the day before clouds gradually increase during the afternoon. Most of the daylight hours should remain dry, making it a solid day for outdoor errands, youth sports, or a walk along the river. Skies will become mostly cloudy by evening.\n\nSunday appears to be the warmest day of the weekend, with temperatures reaching the mid-50s. Cloud cover will dominate much of the day, and a weak system moving through the region could bring light rain or scattered showers, especially later in the afternoon. While no severe weather is expected, it may be wise to keep an umbrella handy if you’ll be out and about.\n\nOverall, the weekend forecast for Dayton features above-average temperatures, manageable winds, and only a modest chance of rain to close things out. Enjoy the milder air while it lasts, as late winter can always surprise us. Stay tuned for updates as we continue to track any small shifts in timing for Sunday’s rain chances.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/J3fhWlZ.jpeg",
    "pubDate": "2026-02-14T02:49:00Z",
    "section": "local",
    "custom": true
  },

    {
    "title": "Skates, Scores and Suspicions: How One Judge’s Marks Stole the Ice Dance Spotlight",
    "url": "milan-winter-olympics-ice-skating-controversy",
    "description": "MILAN — What was meant to be a celebration of grace on ice at the 2026 Winter Olympics turned into one of the most talked-about judging debates in recent Olympic history, leaving fans, athletes and casual viewers asking the same question: what exactly happened in the ice dance final?\n\nAt the center of the controversy is the fiercely contested competition that saw France’s Laurence Fournier Beaudry and Guillaume Cizeron narrowly claim gold over Americans Madison Chock and Evan Bates by just over a single point. The performances themselves were elegant and emotionally charged. It was the score sheet that ignited the firestorm.\n\nA close look at the judging breakdown shows most members of the panel scored the two duos tightly. However, one French judge’s marks stood out dramatically. In the free dance, that judge awarded the French pair significantly higher component scores than the Americans — a gap wide enough that analysts quickly calculated the result may have flipped had those marks fallen more in line with the rest of the panel.\n\nUnder the International Skating Union’s scoring system, the highest and lowest marks for each element are dropped before averaging, a safeguard designed to limit outliers. Even so, critics argue that in a competition decided by razor-thin margins, a single judge’s scoring philosophy — or perceived national bias — can still carry enormous weight.\n\nSocial media lit up within minutes of the final totals being posted. Fans circulated side-by-side comparisons of protocols, former skaters weighed in on television panels, and online petitions calling for greater transparency began to gain traction. Some commentators drew comparisons to past Olympic judging scandals, arguing that figure skating has worked for decades to restore trust and cannot afford renewed doubt.\n\nThe ISU quickly issued a statement defending the integrity of the process, emphasizing that a range of scores is normal in subjective, performance-based sports. Officials maintained that the judging panel followed established procedures and that the final results stand.\n\nChock and Bates handled the aftermath with poise, expressing pride in their performance and appreciation for their supporters. At the same time, they acknowledged that confusion among fans is not healthy for the sport. When audiences struggle to understand how medals are decided, confidence in the system can erode.\n\nIce dance has always walked a delicate line between athletic precision and artistic interpretation. Unlike a race against the clock, it depends on human evaluation of musicality, connection and choreography. That subjectivity is part of its beauty — and its vulnerability.\n\nFor Fournier Beaudry and Cizeron, the gold medal is secure and the history books are written. But long after the Olympic flame is extinguished, the debate over those numbers on a judge’s sheet may linger as a reminder that in figure skating, the drama does not always end when the music stops.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/fclpzPS.jpeg",
    "pubDate": "2026-02-14T03:22:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "No Medal, But a Message: The Winter Olympian Who Chose Memory Over the Podium",
    "url": "ukranian-olymipian-disqualified-for-political-expression",
    "description": "MILAN — At the heart of the 2026 Winter Olympics is a story of sport colliding with conscience — and it doesn’t involve a finish line or podium. Instead, it centers on Ukrainian skeleton racer Vladyslav Heraskevych, whose refusal to remove a custom helmet honoring fallen compatriots cost him his chance to compete in his event.\n\nThe controversy began when Heraskevych arrived at the Milano-Cortina Games with what he called a “helmet of memory” — a racing helmet decorated with portraits of more than twenty Ukrainian athletes and coaches killed since Russia’s invasion of Ukraine in 2022.\n\nOlympic officials quickly warned the 27-year-old that the helmet violated the International Olympic Committee’s strict rules on political expression in competition. Under Olympic guidelines, athletes are prohibited from displaying political, religious or racial messages on the field of play, including during races.\n\nThe IOC and the International Bobsleigh and Skeleton Federation offered Heraskevych compromises — including wearing a plain helmet during competition or a simple black armband instead. They said he could display his memorial helmet before or after his race and at mixed-zone interviews.\n\nBut Heraskevych refused. To him, the images were not a political protest but a deeply personal tribute to those whose dreams, like his, were cut short by war. This is the price of our dignity, he wrote on social media after Olympic officials revoked his place on the start list just minutes before the men’s skeleton event was scheduled to begin.\n\nHeraskevych’s appeal to the Court of Arbitration for Sport was dismissed, with the arbitrator upholding the IOC’s view that freedom of expression at the Games has limits on the field of play to preserve neutrality. The court acknowledged sympathy for his cause but found the Olympic restrictions reasonable and proportionate.\n\nThe ruling stunned many observers and ignited debate around the intersection of human expression and sporting regulation. Ukrainian President Volodymyr Zelenskyy publicly praised Heraskevych and later honored him at home, calling his stand a testament to courage and principle.\n\nSupporters argue that honoring those killed — especially fellow athletes — should not be deemed political. Critics counter that allowing symbolic messages during competition could open the door to a wave of national or ideological statements that overshadow the Games and divide audiences.\n\nThe controversy has rippled beyond skeleton racing, with other Ukrainian athletes reportedly told to modify or cover up helmet art and inscriptions deemed by officials to violate political expression rules.\n\nFor Heraskevych, the Olympics will be remembered not for times or placements, but for a moment when an athlete chose memory over medals. Whether his stand reshapes future Olympic policy or simply becomes another chapter in the ongoing debate over neutrality in sport, it has already ensured that his run — though never taken — will not be forgotten.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/BiXwzMd.jpeg",
    "pubDate": "2026-02-14T03:33:00Z",
    "section": "world",
    "custom": true
  },

    {
    "title": "Tragedy at South Carolina State: Two Dead in Campus Shooting",
    "url": "south-carolina-state-shooting-feb-12-2026",
    "description": "Shock and grief settled over the campus of South Carolina State University this week after a late-night shooting inside a student residential complex left two young men dead and another person injured, shattering what had been an otherwise routine evening on campus.\n\nThe gunfire erupted Thursday night at Hugine Suites, a student housing facility on the university’s campus in Orangeburg, South Carolina. Authorities say emergency calls came in shortly after 9 p.m., prompting a swift response from campus police and local law enforcement. Within minutes, the university issued an emergency alert ordering students to shelter in place as officers worked to secure the area.\n\nThe lockdown lasted into the early morning hours, leaving students barricaded in dorm rooms and apartments, anxiously scrolling through social media and group chats for updates. Some described hearing multiple gunshots echo through the residential complex, followed by sirens and shouted commands from responding officers.\n\nTwo men — 19-year-old Henry L. Crittington of Orangeburg and 18-year-old Terrell Thomas of Norway, South Carolina — were killed. One was pronounced dead at the scene. The other was transported to a local hospital, where he later died from his injuries. A third person, identified as a South Carolina State student, was also shot and injured. Officials have not publicly released details about that individual’s condition.\n\nThe investigation is being led by the South Carolina Law Enforcement Division, known as SLED, with assistance from the Orangeburg County Sheriff’s Office and campus police. Authorities have not yet announced a suspect, motive, or whether anyone has been taken into custody. Investigators are continuing to interview witnesses and review evidence from the scene.\n\nUniversity leaders moved quickly Friday morning to cancel classes and offer counseling services to students, faculty, and staff. In a statement, administrators expressed condolences to the victims’ families and urged the campus community to come together in support of one another during what they described as a heartbreaking time.\n\nFor many students, the tragedy has reopened wounds from previous incidents of violence connected to the campus within the academic year. The recurrence of deadly gunfire has heightened concerns about safety measures, campus security protocols, and the broader issue of gun violence affecting communities across the country.\n\nSouth Carolina State University, a historically Black university with a legacy stretching back more than a century, has long been a pillar of pride for Orangeburg and surrounding communities. Its campus is typically defined by close-knit relationships, academic ambition, and a deep sense of tradition. That sense of normalcy was upended in an instant.\n\nBy Friday afternoon, small groups of students gathered outside residence halls and academic buildings, embracing, praying, and reflecting quietly. Some placed flowers near the entrance of the residential complex. Others simply sat together, trying to process what had happened just hours earlier.\n\nCommunity leaders in Orangeburg also voiced concern, calling for cooperation with investigators and urging calm as authorities continue their work. Law enforcement officials have stated there is no ongoing threat to the campus, but many students say the emotional impact will linger long after the police tape is removed.\n\nAs the investigation unfolds, families are mourning unimaginable losses, classmates are struggling to comprehend the violence, and a university community is once again left grappling with questions that have become all too familiar in campuses and cities nationwide.\n\nIn the days ahead, more details are expected to emerge about what led to the shooting and whether criminal charges will follow. For now, South Carolina State mourns the lives cut short and faces the difficult task of healing while seeking answers.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/D2Y24CP.jpeg",
    "pubDate": "2026-02-14T03:54:00Z",
    "section": "national",
    "custom": true
  },

    {
    "title": "A New Chapter Begins at Chaminade Julienne",
    "url": "chaminade-julienne-appoints-new-president-dr-david-wright",
    "description": "A new era is set to begin at Chaminade Julienne Catholic High School, as school leaders have announced the selection of Dr. David Wright as the institution’s next president.\n\nWright will officially take the helm in July 2026, succeeding longtime president Dan Meixner, who is stepping down after more than two decades of leadership. For a school deeply rooted in tradition yet focused on preparing students for a rapidly changing world, the transition marks both a moment of reflection and an opportunity for renewal.\n\nWright arrives in Dayton from Subiaco Academy in Arkansas, where he has served as headmaster since 2018. In that role, he oversaw strategic planning, enrollment management, and institutional advancement — experience that mirrors many of the challenges and opportunities facing Catholic schools nationwide. His career also includes leadership roles at Gettysburg College, where he worked in athletics and advancement, blending mission-driven leadership with fundraising and operational oversight.\n\nAcademically, Wright brings strong credentials. He earned his undergraduate degree from the State University of New York, a master’s degree from Brigham Young University, and completed doctoral research in leadership development at George Washington University. That focus on leadership theory and formation could prove especially valuable in a Catholic educational environment that emphasizes character development as much as academic success.\n\nBoard leaders say Wright stood out during the search process for his alignment with the school’s founding charisms. Chaminade Julienne traces its roots to the educational missions of the Sisters of Notre Dame de Namur and the Society of Mary (Marianists) — religious communities dedicated to faith formation, service, and academic excellence. Those values remain central to the school’s identity today.\n\nMeixner’s departure closes a significant chapter. During his 22-year tenure, the school expanded academic programming, strengthened campus facilities, and navigated the shifting landscape of private education. Enrollment trends, affordability concerns, and the competitive educational market have tested Catholic schools across Ohio, making steady leadership especially critical.\n\nNow, as Wright prepares to relocate to Dayton, the focus turns to what comes next. Maintaining enrollment, investing in innovation, and preserving the school’s spiritual foundation will all be priorities. At the same time, the incoming president inherits a community known for resilience, diversity, and deep alumni support.\n\nTransitions in leadership often bring uncertainty. But they also offer fresh energy and perspective. For Chaminade Julienne, the appointment of Dr. David Wright signals a commitment to honoring tradition while positioning the school for the future — a balance that has long defined one of Dayton’s most enduring educational institutions.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/zWsAhsc.jpeg",
    "pubDate": "2026-02-14T04:10:00Z",
    "section": "local",
    "custom": true
  },

    {
    "title": "Miami Dominates Ohio 90-74 in the Battle of the Bricks",
    "url": "miami-redhawks-men's-basketball-defeats-ohio-university-bobcats-90-74",
    "description": "The Battle of the Bricks rivalry tilted heavily in favor of the Miami (OH) RedHawks on Friday night, as Miami delivered a commanding 90-74 victory over the Ohio University Bobcats in Oxford. The win keeps Miami’s perfect season alive, extending their record to 25-0 and reinforcing their position atop the Mid-American Conference and national conversation. \n\nFrom the opening tip, Miami looked every bit like the nation’s only unbeaten team, playing with confidence on both ends of the floor. Guard play and balanced scoring were the story for the RedHawks, who continued to execute with precision under pressure. Miami’s offense was efficient and aggressive, pushing tempo and hitting timely shots to keep Ohio at bay throughout the night. \n\nThe Bobcats fought hard and made a few runs, but Miami’s depth and firepower proved too much to overcome. Ohio struggled to slow down Miami’s attack and couldn’t cut the lead to single digits down the stretch, despite gritty effort on both ends. For Ohio, it was a tough test against one of the best teams in the MAC this season. \n\nFor Miami, this win isn’t just another box score — it’s another statement in a historic season. After their 90-74 road win over Marshall earlier in the week that kept them spotless, the RedHawks have now beaten a ranked opponent and a key rival back-to-back, showing why they’re a team to watch as March approaches. \n\nThe Bobcats will look to regroup as they continue conference play, while Miami sets its sights on maintaining its winning streak and building momentum toward postseason play. With the perfect season still on the line, the RedHawks aren’t showing any signs of slowing down anytime soon.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/oqFAGOM.png",
    "pubDate": "2026-02-14T04:24:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "Verizon Under Fire: Outages, Privacy Questions and Public Trust",
    "url": "verizon-wireless-controversy-feb-14-2026",
    "description": "It has been a bruising stretch for Verizon Wireless, the nation’s largest carrier and a flagship brand under Verizon Communications, as the company finds itself navigating a series of controversies that have tested customer patience and drawn scrutiny from Washington.\n\nThe most immediate flashpoint came with a widespread network outage that disrupted service for customers across multiple states. For hours, subscribers reported being unable to make calls, send texts or access mobile data. In an age when smartphones double as wallets, workplaces and lifelines, the outage was more than an inconvenience. It was a reminder of just how dependent Americans are on uninterrupted connectivity.\n\nVerizon offered affected customers a $20 account credit as a goodwill gesture, but many felt the compensation did not match the scale of the disruption. The Federal Communications Commission has since opened an inquiry into the outage, examining its cause and whether emergency services such as 911 were impacted. For a company that markets reliability as a cornerstone of its brand, the investigation underscores the stakes.\n\nAt the same time, Verizon is locked in a heated legal battle with rival T-Mobile. Verizon has filed suit alleging that T-Mobile’s advertising exaggerates how much consumers can save by switching carriers. The dispute centers on whether promotional comparisons are misleading or unfair. While corporate spats over marketing claims are nothing new in the wireless industry, the lawsuit highlights how fiercely competitive — and price sensitive — the market has become.\n\nThe controversies do not end there. Verizon has also been pulled into political crossfire over its compliance with court-ordered requests for phone metadata tied to federal investigations. Several lawmakers criticized the company for turning over records without prior notice, while Verizon has maintained it complied with lawful court orders. The episode has reignited broader debates about privacy, transparency and the obligations telecom providers face when confronted with legal demands.\n\nLayered on top of these public disputes are internal challenges. Verizon has been undergoing restructuring efforts, including significant workforce reductions, as it seeks to streamline operations and improve profitability amid slowing subscriber growth. For employees and customers alike, such moves can raise questions about service quality and corporate priorities.\n\nTaken together, the issues paint a picture of a telecom giant at a crossroads. Verizon remains a dominant force in American wireless service, but dominance does not insulate a company from scrutiny. Network reliability, advertising transparency and customer privacy are not abstract policy debates. They are core elements of trust.\n\nFor millions of subscribers who rely on their phones every hour of every day, the question is simple: can Verizon deliver the dependable service and clear communication it promises? In the coming months, as investigations proceed and lawsuits unfold, the answer may shape not only the company’s reputation but the broader conversation about accountability in the wireless industry.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/ztBMW4s.jpeg",
    "pubDate": "2026-02-14T05:16:00Z",
    "section": "technology",
    "custom": true
  },

    {
    "title": "Flyers Look to Defend Home Court in Key A-10 Showdown with Saint Louis",
    "url": "university-of-dayton-women's-basketball-team-plays-at-ud-arena-feb-14-2026",
    "description": "The calendar says mid-February, and for the Dayton Flyers, that means every possession starts to feel a little heavier.\n\nDayton returns to UD Arena this afternoon for a 1 p.m. tip against Atlantic 10 rival Saint Louis, a matchup that carries more weight than the records alone might suggest. With the conference tournament just weeks away, both teams are jockeying for position in a tightly packed middle of the league standings.\n\nThe Flyers enter the contest at 13-12 overall and 6-8 in Atlantic 10 play. It’s been a season of stretches — flashes of strong offensive execution mixed with frustrating droughts. Dayton is averaging about 66 points per game while allowing just under 68, a slim margin that explains why so many of their conference games have come down to the final minutes.\n\nSaint Louis arrives in Dayton at 11-16 overall and trying to snap a recent losing skid. The Billikens have struggled to generate consistent offense in conference play, including a 42-point outing in their last game. Still, the Flyers know better than to take them lightly.\n\nEarlier this season, Saint Louis edged Dayton 62-58 in a close contest that slipped away late. That result still lingers. The Flyers led for stretches in that game but couldn’t convert key possessions down the stretch, a theme they’ve worked to correct as February basketball intensifies.\n\nHistorically, Dayton has had the upper hand in the series, but the Atlantic 10 rarely offers easy nights. The familiarity between these programs often produces physical, grind-it-out games where rebounding and half-court execution decide the outcome.\n\nFor Dayton, senior guard Nayo Lear and graduate guard Nicole Stephens provide backcourt leadership, while junior center Fatima Ibrahim anchors the interior. When the Flyers are at their best, they balance inside scoring with perimeter shooting and apply steady defensive pressure that forces opponents into late shot-clock decisions.\n\nPlaying at UD Arena could prove significant. Dayton has been up and down at home this season, but the Flyers traditionally feed off their crowd’s energy, especially in tight conference matchups. With postseason positioning on the line, there is little margin for error.\n\nFor fans who may not follow women’s college basketball closely, this is the time of year when the urgency becomes obvious. Conference records determine seeding for the Atlantic 10 tournament, and higher seeds earn more favorable matchups — sometimes the difference between a short stay and a deep March run.\n\nToday’s game may not decide the season, but it could shape the path forward. A Dayton win would steady the Flyers in the middle of the A-10 pack and provide momentum heading into the final stretch. A loss would tighten an already crowded race and increase the pressure in the weeks ahead.\n\nTipoff is set for 1 p.m. at UD Arena, with streaming available on ESPN+. For the Flyers, it’s another opportunity to protect their home floor and rewrite the ending against a conference rival that already stole one earlier this winter.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/3OsWkgN.jpeg",
    "pubDate": "2026-02-14T06:08:00Z",
    "section": "sports",
    "custom": true
  },

    {
    "title": "Inflation Cools Again, Strengthening Case for Macro Stability",
    "url": "assessment-of-feb-13-cpi-data",
    "description": "The latest Consumer Price Index report delivered a welcome signal for markets and policymakers alike, showing that inflation pressures continue to moderate as the new year begins.\n\nHeadline CPI rose 2.4 percent year over year in January, coming in below expectations and marking a continued slowdown from late 2025 levels. On a monthly basis, prices increased a modest 0.2 percent, reinforcing the view that inflation is no longer accelerating. Core inflation, which strips out food and energy, held near 2.5 percent annually, suggesting that underlying price pressures remain contained but not fully extinguished.\n\nThe data triggered a relief response across financial markets. Treasury yields eased following the release, and risk assets including equities posted gains as investors interpreted the report as further evidence that inflation is moving closer to the Federal Reserve’s long-term 2 percent target.\n\nWhile the trend is encouraging, policymakers are unlikely to declare victory just yet. Services inflation, particularly in shelter-related categories, remains sticky. The labor market also continues to show resilience, keeping wage growth elevated enough to warrant caution from the central bank. As a result, the Federal Reserve is expected to remain data dependent rather than pivot quickly toward aggressive rate cuts.\n\nStill, the broader macro backdrop appears more stable than it did in previous quarters. Inflation is cooling without signs of sharp economic deterioration, a combination that strengthens the narrative of a soft landing. Markets are increasingly pricing in gradual policy easing later in the year, contingent on continued progress in price stability.\n\nFor investors, the message is clear: inflation risks have eased, volatility may subside, but the path toward fully normalized policy remains incremental. Stability is improving, though confirmation over multiple reports will be essential before confidence becomes conviction.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/R7tT3uu.jpeg",
    "pubDate": "2026-02-14T06:22:00Z",
    "section": "business",
    "custom": true
  },

    {
    "title": "Fintech Lender Figure Confirms Data Breach Following Employee Account Compromise",
    "url": "fintech-lender-figure-confirms-data-breach",
    "description": "A major player in the financial technology lending space has confirmed it suffered a data breach after hackers gained access to company systems through a compromised employee account.\n\nFigure Technology, a San Francisco-based fintech lender known for its blockchain-driven home equity and consumer loan products, disclosed this week that unauthorized actors accessed customer information following what the company described as a social engineering attack. According to reporting, the attackers tricked an employee into revealing login credentials, allowing them to enter internal systems.\n\nThe breach has been publicly linked to the hacking group known as ShinyHunters, a well-known cybercrime collective that has previously claimed responsibility for high-profile data leaks across multiple industries. The group reportedly sought to monetize the stolen data.\n\nFigure stated that the compromised information may include customer names, addresses, dates of birth, and phone numbers. At this stage, there has been no public confirmation that Social Security numbers, financial account details, or loan payment information were accessed, though investigations remain ongoing.\n\nThe company said it has launched an internal investigation with the assistance of third-party cybersecurity experts and is notifying potentially affected customers. Impacted individuals are being offered complimentary credit monitoring and identity protection services.\n\nThe incident underscores a growing trend in the financial services and fintech sectors, where social engineering attacks — rather than sophisticated technical exploits — are increasingly serving as the primary entry point for breaches. Industry analysts note that employee credential theft continues to be one of the most effective tactics used by cybercriminals targeting firms that hold large volumes of sensitive consumer data.\n\nThe breach at Figure comes amid a wave of cybersecurity incidents affecting financial platforms, lenders, and service providers. In recent months, several fintech and financial infrastructure firms have reported data exposures impacting millions of consumers, highlighting the sector’s attractiveness to threat actors seeking personally identifiable information that can be leveraged for identity theft, phishing campaigns, and fraud.\n\nRegulatory scrutiny of data security practices across the fintech industry is also expected to intensify as lawmakers and federal agencies continue to evaluate cybersecurity standards for non-bank financial institutions. Companies operating in the digital lending space face mounting pressure to demonstrate robust employee training, multi-factor authentication enforcement, and rapid breach response protocols.\n\nFor consumers, experts recommend closely monitoring credit reports and financial accounts for suspicious activity and exercising heightened caution with unsolicited communications that reference personal information.\n\nAs investigations continue, the incident serves as another reminder that in today’s digital financial ecosystem, the human element often remains the most vulnerable link in cybersecurity defenses.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/9IwuGtW.jpeg",
    "pubDate": "2026-02-14T06:46:00Z",
    "section": "business",
    "custom": true
  },

    {
    "title": "A Nation in Quiet Revolt: How Iran’s Unrest Has Spread Far and Wide",
    "url": "nation-in-quiet-revolt-how-iran's-unrest-has-spread-far-and-wide",
    "description": "What began as scattered demonstrations over economic hardship has evolved into one of the most geographically expansive waves of unrest Iran has witnessed in years. From the crowded boulevards of Tehran to smaller provincial towns often absent from international headlines, protest activity has rippled across the country in ways that suggest both deep national frustration and a shifting tactical landscape.\n\nIn its earliest days late last year, the unrest appeared concentrated in major urban centers. Tehran, Mashhad, Isfahan, Shiraz, and Tabriz quickly became focal points, with images of large street gatherings circulating online before authorities imposed communication restrictions. Within days, however, demonstrations were reported in dozens of additional cities. By early January, protest activity had been recorded across all 31 provinces — a sign that grievances were neither isolated nor confined to traditional political strongholds.\n\nWhat makes this wave distinct is not only its breadth but its penetration into smaller municipalities. Towns that rarely feature in political reporting — places far from the capital’s political elite — experienced rallies, strikes, and acts of civil defiance. In several regions, including historically conservative areas and clerical centers, demonstrations challenged assumptions about where dissent can take root.\n\nThe geographic spread expanded rapidly during the first weeks. Independent tracking groups counted protest activity in well over a hundred cities, with some estimates reaching into the high hundreds of distinct locations when smaller gatherings and labor actions were included. The pace of expansion suggested organic mobilization rather than centrally coordinated planning.\n\nBut as the movement spread, so too did the state’s response. Security forces increased their presence nationwide. Internet disruptions and regional blackouts made real-time reporting increasingly difficult. Mass arrests and forceful dispersal tactics were reported in multiple provinces. In some large cities, visible street protests appeared to diminish following intensified crackdowns.\n\nThis does not necessarily signal that the unrest has disappeared. Rather, it appears to have evolved. In place of sustained mass rallies, smaller flash demonstrations, student-led gatherings, labor strikes, and symbolic acts of resistance have continued in various locations. University campuses in particular have remained active nodes of dissent, while some industrial sectors have seen intermittent work stoppages.\n\nThe geography of unrest has therefore shifted from concentrated spectacle to dispersed persistence. Large crowds may gather less frequently, but the movement’s footprint remains wide. Its endurance lies not only in numbers but in its diffusion — across provinces, across social classes, and across generations.\n\nBeyond Iran’s borders, the geographic spread has also taken on a global dimension. Iranian diaspora communities have organized solidarity demonstrations in dozens of countries, amplifying domestic grievances on international stages. While these gatherings do not alter conditions on the ground directly, they underscore the transnational resonance of the unrest.\n\nSeveral underlying drivers continue to shape the situation. Economic pressures — inflation, currency instability, and rising living costs — remain central catalysts. Yet the rhetoric heard during demonstrations has often extended beyond economic reform to broader political demands. This widening scope of grievances has contributed to the nationwide character of the protests.\n\nWhether the movement is growing or shrinking depends on how one measures it. In terms of visible mass mobilization, peak activity appears to have occurred in the initial weeks of expansion. In terms of geographic reach and societal penetration, however, the unrest has already achieved a breadth that is difficult to reverse entirely. Even where streets are quieter, the underlying discontent that fueled the nationwide surge remains unresolved.\n\nIran today is not experiencing a uniform uprising visible in every city square each night. Instead, it is witnessing a dispersed and adaptive form of unrest — one that has touched every province and recalibrated in response to pressure. The story is no longer simply about how many people gather in a single place. It is about how widely dissatisfaction has spread — and how deeply it has embedded itself across the map of the nation.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/A3sWUII.jpeg",
    "pubDate": "2026-02-14T07:21:00Z",
    "section": "world",
    "custom": true
  },

    {
    "title": "U.S. and Taiwan Announce New Trade Deal",
    "url": "us-and-taiwan-new-reciprocal-trade-deal-",
    "description": "The United States and Taiwan have announced a new reciprocal trade agreement aimed at strengthening economic ties and reinforcing supply chain resilience, particularly in the semiconductor industry.\n\nOfficials in Washington say the deal is designed to secure access to advanced chip manufacturing, reduce vulnerabilities exposed during recent global shortages, and deepen cooperation in high-tech sectors. Taiwan remains a central player in global semiconductor production, and U.S. policymakers view closer coordination as critical to economic and national security interests.\n\nAnalysts note that while the agreement signals strategic alignment, key details surrounding enforcement, tariff adjustments, and dispute resolution remain under review. The move is also likely to draw scrutiny from China, which has historically opposed expanded U.S.–Taiwan economic and political engagement. Economists will be watching closely to see whether the pact meaningfully shifts trade balances or primarily serves as a geopolitical statement.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/XGMhB3y.jpeg",
    "pubDate": "2026-02-14T08:58:00Z",
    "section": "business",
    "custom": true
  },

    {
    "title": "Treasury Tightens Clean Energy Tax Credit Rules to Boost Domestic Manufacturing",
    "url": "us-treasury-realeses-new-interim-rules-governing-federal-clean-energy-tax-credits",
    "description": "The United States Department of the Treasury has released interim rules governing federal clean energy tax credits, tightening eligibility requirements for companies that rely heavily on foreign-sourced components.\n\nThe guidance is part of a broader effort to align climate incentives with domestic industrial policy. Under the updated framework, companies seeking federal subsidies for electric vehicles, battery production, and renewable energy infrastructure must meet stricter sourcing thresholds. Officials say the goal is to strengthen domestic manufacturing and reduce supply chain dependence on overseas suppliers.\n\nIndustry leaders have responded cautiously, warning that stricter standards could delay projects or increase short-term costs as companies reconfigure supply chains. Supporters argue the rules will encourage long-term investment in U.S. production capacity and reinforce economic security alongside environmental goals.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/a39Hqec.jpeg",
    "pubDate": "2026-02-14T08:57:00Z",
    "section": "business",
    "custom": true
  }
]