[
  {
    "title": "Kettering Health Notifies Patients of Data Breach Months After Ransomware Attack",
    "url": "custom-kettering-health-data-breach",
    "description": "Kettering Health has begun notifying patients that their personal and medical information may have been compromised in a cyberattack that struck the regional hospital network last year. \n\n\n\nThe healthcare system, which operates hospitals and medical facilities across the Dayton and Miami Valley region, confirmed that the breach stems from a ransomware attack discovered on May 20, 2025. The attack caused widespread technology outages across the network, disrupting patient services, electronic medical records, scheduling systems, and the MyChart patient portal for several days. \n\nIn letters mailed to affected individuals in early February, Kettering Health said an unauthorized party may have accessed its network between April 9 and May 20, 2025, before the intrusion was contained. \n\nAccording to the notification, information potentially exposed varies by patient but may include names, Social Security numbers, driver’s license or passport numbers, financial account details, health insurance information, medical treatment records, billing data, and, in some cases, usernames and passwords. \n\nKettering Health said it launched an investigation with the assistance of third-party cybersecurity experts and notified federal law enforcement. The organization reported that it has since taken steps to strengthen its network security, including reviewing and updating policies, procedures, and monitoring systems. \n\nThe ransomware group known as “Interlock” previously claimed responsibility for the attack, alleging it stole hundreds of gigabytes of data from the health system. Kettering Health has not publicly confirmed the exact volume of data involved but acknowledged that patient information was accessed. \n\nThe breach adds to a growing number of cyberattacks targeting healthcare providers nationwide. Hospitals are frequent targets due to the sensitive nature of medical and personal data, as well as the operational urgency required to maintain patient care. \n\nKettering Health is offering affected individuals complimentary credit monitoring and identity protection services. Patients have a limited window to enroll in those services following receipt of their notification letter. \n\nAt least one lawsuit has been filed in connection with the breach, alleging the healthcare provider failed to adequately protect patient data. The litigation is ongoing. \n\nPatients who believe they may have been affected are encouraged to carefully review any correspondence from Kettering Health, monitor financial and insurance statements, consider placing fraud alerts or credit freezes with credit reporting agencies, and report suspicious activity immediately. \n\nKettering Health operates more than a dozen medical centers and numerous outpatient facilities throughout southwest Ohio, serving hundreds of thousands of patients each year.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/d6cieMB.jpeg",
    "pubDate": "2026-02-12T11:47:00Z",
    "section": "local",
    "custom": true
  },

  {
    "title": "Nintendo Switch 2 Is Off to a Blazing Start: Here Are All the Big New Games on the Way",
    "url": "nintendo-switch-2-new-games-feb-26",
    "description": "The Nintendo Switch 2 has officially ushered in a new era for Nintendo, and if the release slate is any indication, the company is not slowing down. With a mix of brand-new first-party blockbusters, long-awaited sequels, upgraded editions of modern classics, and major third-party support, the Switch 2 is shaping up to have one of the strongest early libraries in Nintendo history.\n\nLaunching alongside the system, Mario Kart World set the tone for the console’s ambitions. Expanding beyond traditional circuits, the new entry introduces larger, more dynamic tracks and enhanced online features, positioning it as the definitive Mario Kart experience for this generation. Nintendo has long relied on Mario Kart to anchor new hardware, and with the added power of Switch 2, the series finally has room to evolve in meaningful ways.\n\nReports also point toward a brand-new 3D Mario adventure arriving in 2026. While Nintendo has not revealed full details, history suggests this could become the system’s defining title. From Super Mario 64 to Galaxy to Odyssey, each major 3D installment has redefined platforming for its era. Expectations are high that this next entry will serve as both a creative leap and a technical showcase.\n\nNintendo’s early first-party lineup is already impressively diverse. Mario Tennis Fever brings fast-paced sports action with modernized visuals. Kirby Air Riders revives the cult-favorite racing spin-off with upgraded performance. Tomodachi Life: Living the Dream marks the return of the chaotic Mii life simulation series fans have requested for years. Fire Emblem: Fortune’s Weave continues the tactical RPG franchise’s momentum with a new strategic epic. And after years of anticipation, Metroid Prime 4: Beyond is finally landing with enhancements tailored for the new hardware.\n\nPerhaps the biggest surprise is the scale of third-party support. Switch 2 is not just receiving Nintendo exclusives; it is attracting major modern releases as well. Resident Evil Requiem and Resident Evil Village are both arriving in enhanced editions. Fallout 4: Anniversary Edition is coming to the platform. Cyberpunk 2077: Ultimate Edition and Street Fighter 6 are also confirmed. Sega is bringing Yakuza Kiwami 3, while Dynasty Warriors 3: Complete Edition Remastered adds large-scale action to the lineup. Hades II continues its momentum on the system, and The Duskbloods, connected to FromSoftware’s parent company, is slated for release. Digimon Story: Time Stranger further strengthens the RPG offering.\n\nThe Pokémon franchise is also expanding on Switch 2 with Pokémon Pokopia, a life-simulation spin-off that takes the brand in a fresh direction. While a new mainline Pokémon RPG has not yet been detailed, expectations are high that Switch 2 will eventually host the series’ next major evolution.\n\nBeyond the headline titles, the lineup includes darker and more experimental experiences. Reanimal delivers a cinematic horror adventure. Opus: Prism Peak offers a narrative-driven journey. Kingdom’s Return: Time-Eating Fruit and the Ancient Monster introduces an ambitious action-RPG concept. Rune Factory: Guardians of Azuma arrives in a Switch 2 edition. Enhanced versions of The Legend of Zelda: Breath of the Wild and Tears of the Kingdom take advantage of improved performance and visuals.\n\nLooking at the release window across 2025 and 2026, the cadence is aggressive. 2025 brought Mario Kart World, Kirby Air Riders, and Hades II. Early 2026 adds Mario Tennis Fever, Reanimal, and the new Resident Evil titles. Spring and summer introduce Pokémon Pokopia, Tomodachi Life: Living the Dream, Kingdom’s Return, and Digimon Story. Late 2026 and beyond are expected to feature Fire Emblem: Fortune’s Weave, Metroid Prime 4: Beyond, Fallout 4: Anniversary Edition, The Duskbloods, and the anticipated new 3D Mario.\n\nIf even a portion of these titles meet expectations, the Nintendo Switch 2 will not just be a successful successor; it could become one of Nintendo’s strongest platform launches ever. By anchoring the system with Mario Kart, preparing a new 3D Mario, delivering long-awaited sequels like Metroid Prime 4, securing substantial third-party AAA support, and maintaining Nintendo’s experimental charm with titles like Tomodachi Life and Pokémon spin-offs, the company appears ready to compete at full scale once again.\n\nFor longtime Nintendo fans and the broader gaming industry alike, this lineup signals ambition. And if this is only the beginning, the Switch 2 era may just be getting started.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/3NJLt2q.jpeg",
    "pubDate": "2026-02-12T21:54:40Z",
    "section": "entertainment",
    "custom": true
  },

    {
    "title": "Montgomery County officials have approved plans to relocate the Job Center",
    "url": "montgomery-county-moves-job-center",
    "description": "Montgomery County officials have approved plans to relocate the county’s Job Center, setting the stage for significant changes to how workforce and family services are delivered in the region.\n\nThe current Job Center, located at 1111 S. Edwin C. Moses Blvd. in Dayton, has operated in a building leased from St. Vincent de Paul for nearly 30 years. County leaders say the move is aimed at modernizing services and creating a more efficient, accessible, and welcoming environment for residents who rely on employment assistance, job training, and family support programs.\n\nCommissioners have indicated that rather than renewing the long-term lease at the existing site, the county will pursue plans for a newly developed facility. While a permanent location has not yet been finalized, officials say the goal is to better align services under one roof and improve the overall experience for job seekers and families navigating public assistance programs.\n\nTo ensure there is no interruption in services, several departments will temporarily relocate in the coming months. Adult Career Services will move to the Business Solutions Center on Cincinnati Street. Youth Career Services will operate out of the Employment Opportunity Center on West Third Street. Meanwhile, Job and Family Services offices will transition to the Southview Center on Thorpe Drive. County officials stress that residents will continue to have access to the same core services during the transition.\n\nThe Job Center houses OhioMeansJobs|Montgomery County along with workforce development programs and other support services designed to connect residents with employment opportunities and training resources. Leaders say the relocation effort reflects a broader strategy to strengthen the county’s workforce infrastructure and position the region for long-term economic growth.\n\nDetails regarding the final site selection, construction timeline, and projected costs are expected to be released in future announcements. As plans move forward, residents and stakeholders will be watching closely to see how the transition unfolds and what the new facility will ultimately look like.\n\nFor continuing coverage on this developing story and updates on the future home of the Montgomery County Job Center, be sure to check back regularly.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/4Pdt6Hd.jpeg",
    "pubDate": "2026-02-12T22:17:00Z",
    "section": "local",
    "custom": true
  },

   {
    "title": "Cash Forecast Signals 2027 Showdown: Oakwood Schools May Ask Voters for New Operating Levy",
    "url": "oakwood-school-levy-2027",
    "description": "Oakwood City Schools may return to voters in 2027 for a new operating levy as district leaders warn that projected deficit spending could begin that year if no additional revenue is secured.\n\nDistrict Treasurer Laura Sauber recently presented long-term financial forecasts showing expenditures beginning to outpace revenues in fiscal year 2027. While the district currently maintains a healthy cash balance, officials say that cushion would steadily decline over the following years without new funding.\n\nAccording to the district’s five-year forecast, Oakwood expects to end fiscal year 2025 with roughly $13.9 million in cash reserves, despite spending exceeding revenues during the year. Revenues and expenditures are projected to remain relatively flat in fiscal year 2026. However, by 2027 and beyond, rising costs — including salaries, benefits, utilities and contracted services — are expected to outstrip incoming funds.\n\nSchool leaders emphasized that no levy has yet been placed on the ballot. The discussion is part of routine financial planning designed to give the board time to evaluate options well in advance of potential shortfalls.\n\nIf pursued, a 2027 measure would likely be a new-money operating levy, which would generate additional local tax revenue to support day-to-day expenses such as classroom instruction, staffing, transportation and student services. Operating levies differ from permanent improvement levies or bond issues, which are typically restricted to buildings and facilities.\n\nIn the nearer term, Oakwood schools plan to seek renewal of an existing permanent improvement levy in 2026. That measure would not raise new taxes but would continue funding for maintenance and capital needs.\n\nOakwood voters have supported several recent school funding initiatives, including a combined operating and permanent improvement levy in 2023 and a bond issue in 2025 aimed at updating elementary school facilities. The district’s leadership says those measures addressed specific operational and building needs but did not eliminate the long-term impact of inflation and cost growth.\n\nDistrict officials say they will continue monitoring enrollment trends, state funding formulas and expenditure growth before making any formal decision about a 2027 ballot request.\n\nThe Oakwood Board of Education is expected to revisit its financial outlook in upcoming meetings as it weighs whether to formally ask residents for additional operating support. Community members can expect further discussion and public input opportunities before any levy is placed on the ballot.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/fmTDE4U.jpeg",
    "pubDate": "2026-02-13T14:58:00Z",
    "section": "local",
    "custom": true
  },

   {
    "title": "Major U.S. Airspace Incident - El Paso Airspace Shutdown",
    "url": "el-paso-airspace-shutdown",
    "description": "Laser Confusion Over Texas: Military Anti-Drone Test Triggers FAA Shutdown of El Paso Airspace\n\nAn unexpected airspace shutdown over El Paso, Texas, has ignited national debate over military technology, aviation safety, and federal coordination after a counter-drone laser system was deployed near a major civilian airport.\n\nThe incident began when the Federal Aviation Administration (FAA) abruptly halted flights in and out of El Paso International Airport, citing “special security reasons.” A Notice to Airmen (NOTAM) restricted civilian air traffic, grounding commercial flights and disrupting medical transport operations. Initially described as a security measure that could last up to 10 days, the restriction was lifted within hours after federal officials determined there was no ongoing threat to aviation safety.\n\nAt the center of the controversy is the reported use of a 20-kilowatt directed-energy weapon known as LOCUST, deployed by U.S. Customs and Border Protection (CBP) near Fort Bliss with Pentagon authorization. The laser system was allegedly used to target what authorities believed to be cartel-operated drones flying near the U.S.–Mexico border. However, subsequent reporting suggested the objects may have been harmless party balloons, raising questions about the reliability of threat assessments and the decision-making process that followed.\n\nThe rapid shutdown — and reversal — exposed what lawmakers are calling a serious breakdown in communication between federal agencies. Members of Congress from both parties have criticized the apparent lack of coordination between the FAA, the Department of Defense, and CBP. Senate oversight discussions this week focused on how advanced military systems were deployed in proximity to civilian air corridors without prior notice to aviation authorities or local leaders.\n\nEl Paso officials said they were caught off guard by the FAA order, which sent confusion rippling through airlines, airport staff, and travelers. Emergency medical flights were temporarily disrupted, and commercial carriers scrambled to reroute aircraft. Though operations resumed the same day, the episode has intensified scrutiny of how emerging defense technologies are integrated into domestic airspace.\n\nFederal authorities have long warned about increased drone activity along the southern border, including surveillance operations allegedly linked to Mexican drug cartels. The Department of Homeland Security has invested heavily in counter-drone capabilities in recent years, arguing that unmanned aerial systems pose a growing threat to border security. But aviation experts caution that high-powered directed-energy systems — especially lasers — require strict coordination protocols when used near civilian airports, where even minor miscalculations could have catastrophic consequences.\n\nTransportation officials have stated that the perceived threat was “neutralized,” but have offered limited details about what triggered the initial alert or how interagency communication broke down so dramatically. Lawmakers are now calling for clearer rules governing the domestic use of military-grade counter-drone technology and better safeguards to prevent future airspace disruptions.\n\nAs investigations continue, the El Paso incident is emerging as a pivotal test of how the United States balances national security innovation with the safety of its civilian aviation system. What began as a localized security response has quickly evolved into a broader reckoning over oversight, transparency, and the risks of deploying advanced weapons technology close to home.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/wGta1AR.jpeg",
    "pubDate": "2026-02-13T15:11:00Z",
    "section": "national",
    "custom": true
  },

   {
    "title": "Judge Keeps Haiti TPS Protections in Place, Easing Fears in Springfield Community",
    "url": "springfield_tps_stays_in_place",
    "description": "A federal judge has denied the federal government’s request to move forward with ending Temporary Protected Status for Haitians, delivering temporary relief to hundreds of families in Springfield and across the Miami Valley.\n\nU.S. District Judge Ana Reyes ruled this week that the Department of Homeland Security cannot lift protections for Haitian TPS holders while the legal battle continues in higher courts. The decision blocks the administration’s attempt to allow the expiration to proceed during the appeals process.\n\nTemporary Protected Status, commonly known as TPS, allows people from certain countries experiencing armed conflict, natural disasters, or extraordinary conditions to live and work legally in the United States for designated periods of time. Haiti has been designated for TPS following years of political instability, gang violence, and natural disasters, including the devastating 2010 earthquake.\n\nIn her decision, Judge Reyes expressed concern that ending TPS immediately could put Haitian immigrants at risk. TPS applicants are required to provide their names and current addresses to the government as part of the registration process. The court noted that the Department of Homeland Security already possesses that information, raising fears within immigrant communities that individuals could be quickly located if protections were lifted.\n\nFederal attorneys argued that Haitian nationals would not be singled out if TPS were terminated, but instead would be treated like others without legal status. The judge was not persuaded, writing that the government failed to show it would suffer irreparable harm if protections remained in place while the case is appealed.\n\nThe ruling does not permanently extend TPS for Haitians. Instead, it preserves the status quo while the case works its way through the appellate courts. Legal experts say the issue could ultimately reach the U.S. Supreme Court.\n\nThe decision carries particular weight in Springfield, which has a growing Haitian community. Many families have built lives in Clark County over the past several years, filling jobs in manufacturing, healthcare support, food service, and other sectors. Community leaders say the uncertainty surrounding TPS has created anxiety among residents worried about deportation and family separation.\n\nSome local residents have voiced support for maintaining protections, pointing to Haiti’s ongoing humanitarian crisis. Others argue TPS was intended to be temporary and should not become a long-term solution. The debate has played out both nationally and within the Miami Valley.\n\nFor now, Haitian TPS holders in Springfield can continue to live and work legally while the courts consider the broader legal questions surrounding executive authority and immigration policy.\n\nAs the appeals process unfolds, families across the region are watching closely. The outcome could shape not only their futures, but also the future of Temporary Protected Status nationwide. Check back for updates as this developing story continues.",
    "source": "The Dayton Enquirer",
    "image": "https://i.imgur.com/HK8bWmc.jpeg",
    "pubDate": "2026-02-13T15:30:00Z",
    "section": "local",
    "custom": true
  }
]